app/Controllers/absensi.php

    public function index(){
        $user =  session()->get('guru_id');
        $builder = Database::connect()->table('Murid');
        $builder->select('absensi.*, Murid.*, Kelompok.*');
        $builder->join('absensi','Murid.murid_id = absensi.murid_id');
        $builder->join('Kelompok','Kelompok.kelompok_id = Murid.kelompok_id','left');
        $builder->join('Guru','Guru.guru_id = Kelompok.guru_id','left');
        $builder->where('Guru.guru_id',$user);
           $builder->orWhere('Kelompok.assguru_id',$user);
        $builder->groupBy('tanggal');
        $builder->orderBy('tanggal','desc');


        // print_r($builder->get()->getResult());
        $data = $builder->get()->getResult();
---
SELECT `absensi`.*, `Murid`.*, `Kelompok`.*
FROM `Murid`
JOIN `absensi` ON `Murid`.`murid_id` = `absensi`.`murid_id`
LEFT JOIN `Kelompok` ON `Kelompok`.`kelompok_id` = `Murid`.`kelompok_id`
LEFT JOIN `Guru` ON `Guru`.`guru_id` = `Kelompok`.`guru_id`
WHERE `Guru`.`guru_id` IS NULL
GROUP BY `tanggal`
ORDER BY `tanggal` DESC

    public function addAbsensi(){
        $user =  session()->get('guru_id');
        $builder = Database::connect()->table('Murid');
        $builder->select('Murid.*, Kelompok.*');
        $builder->join('Kelompok','Kelompok.kelompok_id = Murid.kelompok_id','left');
        $builder->join('Guru','Guru.guru_id = Kelompok.guru_id','left');
        // $builder->join('Guru G','Guru.guru_id = Kelompok.assguru_id','left');
        $builder->where('Guru.guru_id',$user);
        $builder->orWhere('Kelompok.assguru_id',$user);

        // print_r($builder->get()->getResult());
        $data = $builder->get()->getResult();
---
SELECT `Murid`.*, `Kelompok`.*
FROM `Murid`
LEFT JOIN `Kelompok` ON `Kelompok`.`kelompok_id` = `Murid`.`kelompok_id`
LEFT JOIN `Guru` ON `Guru`.`guru_id` = `Kelompok`.`guru_id`
WHERE `Guru`.`guru_id` IS NULL