app/Controllers/Home.php

SELECT `Guru`.*, `Kelompok`.*
FROM `Guru`
LEFT JOIN `Kelompok` ON `Kelompok`.`guru_id` = `Guru`.`guru_id`
WHERE `guru_username` = 'superadmin'
---
    public function index()
    {

        $model = new GuruModel();

        $username = $this->session->get('username');
        $guru_nama = $this->session->get('nama');
        $guru_id = $this->session->get('guru_id');
        // echo $guru_id;

        $builder = Database::connect()->table('Guru');
        $builder->select('Guru.*, Kelompok.*');
        $builder->join('Kelompok','Kelompok.guru_id = Guru.guru_id','left');
        $builder->where('guru_username',$username);

        $presence = $this->cekPresensi();

        $data = $builder->get()->getResult();

SELECT `Presensidata`.*
FROM `Presensidata`
WHERE `guru_id` = '0'
AND `presensidata_tanggal` = '2025-07-17'
---
     public function cekPresensi(){
        $db = \Config\Database::connect();
        $session = session();
        $guru_id = session()->get('guru_id');
        // echo $guru_id;
        $builder = $db->table('Presensidata');
        $builder->select('Presensidata.*');
        $builder->where('guru_id', $guru_id);
        $builder->where('presensidata_tanggal', date("Y-m-d"));

        $query = $builder->get();